PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/chip/lpc43_rgu.h
#define RGU_STATUS3_I2C0_RST_SHIFT       (0)        /* Bits 0-1: 1:0  Status of the I2C0_RST reset generator output */
#define RGU_STATUS3_I2C0_RST_MASK        (3 << RGU_STATUS3_I2C0_RST_SHIFT)
#  define RGU_STATUS3_I2C0_RST_NONE      (0 << RGU_STATUS3_I2C0_RST_SHIFT) /* No reset activated */
#  define RGU_STATUS3_I2C0_RST_HW        (1 << RGU_STATUS3_I2C0_RST_SHIFT) /* Activated by reset generator */
#  define RGU_STATUS3_I2C0_RST_SW        (3 << RGU_STATUS3_I2C0_RST_SHIFT) /* Activated by software */
#define RGU_STATUS3_I2C1_RST_SHIFT       (2)        /* Bits 2-3: 3:2  Status of the I2C1_RST reset generator output */
#define RGU_STATUS3_I2C1_RST_MASK        (3 << RGU_STATUS3_I2C1_RST_SHIFT)
#  define RGU_STATUS3_I2C1_RST_NONE      (0 << RGU_STATUS3_I2C1_RST_SHIFT) /* No reset activated */
#  define RGU_STATUS3_I2C1_RST_HW        (1 << RGU_STATUS3_I2C1_RST_SHIFT) /* Activated by reset generator */
#  define RGU_STATUS3_I2C1_RST_SW        (3 << RGU_STATUS3_I2C1_RST_SHIFT) /* Activated by software */
#define RGU_STATUS3_SSP0_RST_SHIFT       (4)        /* Bits 4-5: 5:4  Status of the SSP0_RST reset generator output */
#define RGU_STATUS3_SSP0_RST_MASK        (3 << RGU_STATUS3_SSP0_RST_SHIFT)
#  define RGU_STATUS3_SSP0_RST_NONE      (0 << RGU_STATUS3_SSP0_RST_SHIFT) /* No reset activated */
#  define RGU_STATUS3_SSP0_RST_HW        (1 << RGU_STATUS3_SSP0_RST_SHIFT) /* Activated by reset generator */
#  define RGU_STATUS3_SSP0_RST_SW        (3 << RGU_STATUS3_SSP0_RST_SHIFT) /* Activated by software */
#define RGU_STATUS3_SSP1_RST_SHIFT       (6)        /* Bits 6-7: 7:6  Status of the SSP1_RST reset generator output */
#define RGU_STATUS3_SSP1_RST_MASK        (3 << RGU_STATUS3_SSP1_RST_SHIFT)
#  define RGU_STATUS3_SSP1_RST_NONE      (0 << RGU_STATUS3_SSP1_RST_SHIFT) /* No reset activated */
#  define RGU_STATUS3_SSP1_RST_HW        (1 << RGU_STATUS3_SSP1_RST_SHIFT) /* Activated by reset generator */
#  define RGU_STATUS3_SSP1_RST_SW        (3 << RGU_STATUS3_SSP1_RST_SHIFT) /* Activated by software */
#define RGU_STATUS3_I2S_RST_SHIFT        (8)        /* Bits 8-9: 9:8  Status of the I2S_RST reset generator output */
#define RGU_STATUS3_I2S_RST_MASK         (3 << RGU_STATUS3_I2S_RST_SHIFT)
#  define RGU_STATUS3_I2S_RST_NONE       (0 << RGU_STATUS3_I2S_RST_SHIFT) /* No reset activated */
#  define RGU_STATUS3_I2S_RST_HW         (1 << RGU_STATUS3_I2S_RST_SHIFT) /* Activated by reset generator */
#  define RGU_STATUS3_I2S_RST_SW         (3 << RGU_STATUS3_I2S_RST_SHIFT) /* Activated by software */
#define RGU_STATUS3_SPIFI_RST_SHIFT      (10)       /* Bits 10-11: 11:10  Status of the SPIFI_RST reset generator output */
#define RGU_STATUS3_SPIFI_RST_MASK       (3 << RGU_STATUS3_SPIFI_RST_SHIFT)
#  define RGU_STATUS3_SPIFI_RST_NONE     (0 << RGU_STATUS3_SPIFI_RST_SHIFT) /* No reset activated */
#  define RGU_STATUS3_SPIFI_RST_HW       (1 << RGU_STATUS3_SPIFI_RST_SHIFT) /* Activated by reset generator */
#  define RGU_STATUS3_SPIFI_RST_SW       (3 << RGU_STATUS3_SPIFI_RST_SHIFT) /* Activated by software */
#define RGU_STATUS3_CAN1_RST_SHIFT       (12)       /* Bits 12-13: 13:12  Status of the CAN1_RST reset generator output */
#define RGU_STATUS3_CAN1_RST_MASK        (3 << RGU_STATUS3_CAN1_RST_SHIFT)
#  define RGU_STATUS3_CAN1_RST_NONE      (0 << RGU_STATUS3_CAN1_RST_SHIFT) /* No reset activated */
#  define RGU_STATUS3_CAN1_RST_HW        (1 << RGU_STATUS3_CAN1_RST_SHIFT) /* Activated by reset generator */
#  define RGU_STATUS3_CAN1_RST_SW        (3 << RGU_STATUS3_CAN1_RST_SHIFT) /* Activated by software */
#define RGU_STATUS3_CAN0_RST_SHIFT       (14)       /* Bits 14-15: 15:14  Status of the CAN0_RST reset generator output */
#define RGU_STATUS3_CAN0_RST_MASK        (3 << RGU_STATUS3_CAN0_RST_SHIFT)
#  define RGU_STATUS3_CAN0_RST_NONE      (0 << RGU_STATUS3_CAN0_RST_SHIFT) /* No reset activated */
#  define RGU_STATUS3_CAN0_RST_HW        (1 << RGU_STATUS3_CAN0_RST_SHIFT) /* Activated by reset generator */
#  define RGU_STATUS3_CAN0_RST_SW        (3 << RGU_STATUS3_CAN0_RST_SHIFT) /* Activated by software */
#define RGU_STATUS3_M0APP_RST_SHIFT      (16)       /* Bits 16-17: 17:16  Status of the M0APP_RST reset generator output */
#define RGU_STATUS3_M0APP_RST_MASK       (3 << RGU_STATUS3_M0APP_RST_SHIFT)
#  define RGU_STATUS3_M0APP_RST_NONE     (0 << RGU_STATUS3_M0APP_RST_SHIFT) /* No reset activated */
#  define RGU_STATUS3_M0APP_RST_HW       (1 << RGU_STATUS3_M0APP_RST_SHIFT) /* Activated by reset generator */
#  define RGU_STATUS3_M0APP_RST_SW       (3 << RGU_STATUS3_M0APP_RST_SHIFT) /* Activated by software */
#define RGU_STATUS3_SGPIO_RST_SHIFT      (18)       /* Bits 18-19: 19:18  Status of the SGPIO_RST reset generator output */
#define RGU_STATUS3_SGPIO_RST_MASK       (3 << RGU_STATUS3_SGPIO_RST_SHIFT)
#  define RGU_STATUS3_SGPIO_RST_NONE     (0 << RGU_STATUS3_SGPIO_RST_SHIFT) /* No reset activated */
#  define RGU_STATUS3_SGPIO_RST_HW       (1 << RGU_STATUS3_SGPIO_RST_SHIFT) /* Activated by reset generator */
#  define RGU_STATUS3_SGPIO_RST_SW       (3 << RGU_STATUS3_SGPIO_RST_SHIFT) /* Activated by software */
#define RGU_STATUS3_SPI_RST_SHIFT        (20)       /* Bits 20-21: 21:20  Status of the SPI_RST reset generator output */
#define RGU_STATUS3_SPI_RST_MASK         (3 << RGU_STATUS3_SPI_RST_SHIFT)
#  define RGU_STATUS3_SPI_RST_NONE       (0 << RGU_STATUS3_SPI_RST_SHIFT) /* No reset activated */
#  define RGU_STATUS3_SPI_RST_HW         (1 << RGU_STATUS3_SPI_RST_SHIFT) /* Activated by reset generator */
#  define RGU_STATUS3_SPI_RST_SW         (3 << RGU_STATUS3_SPI_RST_SHIFT) /* Activated by software */
                                                    /* Bits 22-31:  Reserved */
/* Reset active status register */

#define RGU_ACTIVE0_CORE_RST             (1 << 0)
#define RGU_ACTIVE0_PERIPH_RST           (1 << 1)
#define RGU_ACTIVE0_MASTER_RST           (1 << 2)
                                                   /* Bit 3:  Reserved */
#define RGU_ACTIVE0_WWDT_RST             (1 << 4)
#define RGU_ACTIVE0_CREG_RST             (1 << 5)
                                                   /* Bits 6-7:  Reserved */
#define RGU_ACTIVE0_BUS_RST              (1 << 8)
#define RGU_ACTIVE0_SCU_RST              (1 << 9)
                                                   /* Bits 10-12:  Reserved */
#define RGU_ACTIVE0_M4_RST               (1 << 13)
                                                   /* Bits 14-15:  Reserved */
#define RGU_ACTIVE0_LCD_RST              (1 << 16)
#define RGU_ACTIVE0_USB0_RST             (1 << 17)
#define RGU_ACTIVE0_USB1_RST             (1 << 18)
#define RGU_ACTIVE0_DMA_RST              (1 << 19)
#define RGU_ACTIVE0_SDIO_RST             (1 << 20)
#define RGU_ACTIVE0_EMC_RST              (1 << 21)
#define RGU_ACTIVE0_ETHERNET_RST         (1 << 22)
                                                   /* Bits 23-24:  Reserved */
#define RGU_ACTIVE0_FLASHA_RST           (1 << 25)
                                                   /* Bit 26:  Reserved */
#define RGU_ACTIVE0_EEPROM_RST           (1 << 27)
#define RGU_ACTIVE0_GPIO_RST             (1 << 28)
#define RGU_ACTIVE0_FLASHB_RST           (1 << 29)
                                                   /* Bits 30-31:  Reserved */
/* Reset active status register */

#define RGU_ACTIVE1_TIMER0_RST           (1 << 0)
#define RGU_ACTIVE1_TIMER1_RST           (1 << 1)
#define RGU_ACTIVE1_TIMER2_RST           (1 << 2)
#define RGU_ACTIVE1_TIMER3_RST           (1 << 3)
#define RGU_ACTIVE1_RITIMER_RST          (1 << 4)
#define RGU_ACTIVE1_SCT_RST              (1 << 5)
#define RGU_ACTIVE1_MCPWM_RST            (1 << 6)
#define RGU_ACTIVE1_QEI_RST              (1 << 7)
#define RGU_ACTIVE1_ADC0_RST             (1 << 8)
#define RGU_ACTIVE1_ADC1_RST             (1 << 9)
#define RGU_ACTIVE1_DAC_RST              (1 << 10)
                                                    /* Bit 11:  Reserved */
#define RGU_ACTIVE1_USART0_RST           (1 << 12)
#define RGU_ACTIVE1_UART1_RST            (1 << 13)
#define RGU_ACTIVE1_USART2_RST           (1 << 14)
#define RGU_ACTIVE1_USART3_RST           (1 << 15)
#define RGU_ACTIVE1_I2C0_RST             (1 << 16)
#define RGU_ACTIVE1_I2C1_RST             (1 << 17)
#define RGU_ACTIVE1_SSP0_RST             (1 << 18)
#define RGU_ACTIVE1_SSP1_RST             (1 << 19)
#define RGU_ACTIVE1_I2S_RST              (1 << 20)
#define RGU_ACTIVE1_SPIFI_RST            (1 << 21)
#define RGU_ACTIVE1_CAN1_RST             (1 << 22)
#define RGU_ACTIVE1_CAN0_RST             (1 << 23)
#define RGU_ACTIVE1_M0APP_RST            (1 << 24)
#define RGU_ACTIVE1_SGPIO_RST            (1 << 25)
#define RGU_ACTIVE1_SPI_RST              (1 << 26)
                                                    /* Bits 27-31:  Reserved */
/* Reset external status register 0 for CORE_RST */

#define RGU_EXTSTAT_CORE_EXTRESET        (1 << 0)   /* Bit 0: Reset activated by external reset from reset pin
                                                    /* Bits 1-3: Reserved */
#define RGU_EXTSTAT_CORE_BODRESET        (1 << 4)   /* Bit 4: Reset activated by BOD reset */
#define RGU_EXTSTAT_CORE_WWDTRESET       (1 << 5)   /* Bit 5: Reset activated by WWDT time-out */
                                                    /* Bits 6-31: Reserved */
/* Reset external status register 1 for PERIPH_RST */
                                                    /* Bit 0: Reserved */
#define RGU_EXTSTAT_PERIPH_CORERESET     (1 << 1)   /* Bit 1: Reset activated by CORE_RST output */
                                                    /* Bits 2-31: Reserved */
/* Reset external status register 2 for MASTER_RST */
                                                    /* Bits 0-1: Reserved */
#define RGU_EXTSTAT_MASTER_PERIPHRESET   (1 << 2)   /* Bit 2: Reset activated by PERIPHERAL_RST output */
                                                    /* Bits 2-31: Reserved */
/* Reset external status register 4 for WWDT_RST */
                                                    /* Bit 0: Reserved */
#define RGU_EXTSTAT_WWDT_CORERESET       (1 << 1)   /* Bit 1: Reset activated by CORE_RST output */
                                                    /* Bits 2-31: Reserved */
/* Reset external status register 5 for CREG_RST */
                                                    /* Bit 0: Reserved */
#define RGU_EXTSTAT_CREG_CORERESET       (1 << 1)   /* Bit 1: Reset activated by CORE_RST output */
                                                    /* Bits 2-31: Reserved */
/* Reset external status registers for PERIPHERAL_RESET */
                                                    /* Bits 0-1: Reserved */
#define RGU_EXTSTAT_PERIPH_RESET         (1 << 2)   /* Bit 2: Reset activated by PERIPHERAL_RST output */
                                                    /* Bits 2-31: Reserved */
/* Reset external status registers for MASTER_RESET */
                                                    /* Bits 0-2: Reserved */
#define RGU_EXTSTAT_MASTER_RESET         (1 << 3)   /* Bit 3: Reset activated by MASTER_RST output */
                                                    /* Bits 2-31: Reserved */

/****************************************************************************************************
 * Public Types
 ****************************************************************************************************/

/****************************************************************************************************
 * Public Data
 ****************************************************************************************************/

/****************************************************************************************************
 * Public Functions
 ****************************************************************************************************/

#endif /* __ARCH_ARM_SRC_LPC43XX_CHIP_LPC43_RGU_H */
